app/views/caronas/_form.html.erb


  <% campus = Campus.pluck(:description) %>
---
SELECT `campus`.`description` FROM `campus`