app/views/caronas/edit.html.erb

SELECT `paradas`.* FROM `paradas` WHERE `paradas`.`carona_id` = 11
SELECT 1 AS one FROM `paradas` WHERE `paradas`.`carona_id` = 5 LIMIT 1
---
                        <h2 class="m-4">Paradas</h2>
                        <% if @carona.paradas.any? %>
                                <div class="paradas">
                                        <% @carona.paradas.each do |parada| %>