app/views/caronas/show.html.erb

                    <div class="d-flex justify-content-center center-content align-items-center flex-column">
                    <% if @carona.paradas.any? %>
---
SELECT `paradas`.* FROM `paradas` WHERE `paradas`.`carona_id` = 3
SELECT 1 AS one FROM `paradas` WHERE `paradas`.`carona_id` = 5 LIMIT 1

                        <div class="paradas">
                        <% @carona.paradas.each do |parada| %>
---
SELECT `paradas`.* FROM `paradas` WHERE `paradas`.`carona_id` = 3