app/controllers/campus_controller.rb

  def index
    @campus = Campu.all
---
SELECT `campus`.* FROM `campus`

  def create
    @campu = Campu.new(campu_params)

    respond_to do |format|
      if @campu.save
---
INSERT INTO `campus` (`description`, `adress`, `number`, `neighbourhood`, `city`, `cep`, `deactivationDate`, `created_at`, `updated_at`) VALUES ('Praia vermelha', 'passo da patria', 234, 'niteroi', 'rio', 231412314, NULL, '2023-08-10 21:16:55.289766', '2023-08-10 21:16:55.289766')

  def update
    respond_to do |format|
      if @campu.update(campu_params)
---
UPDATE `campus` SET `campus`.`neighbourhood` = 'Gragoatá', `campus`.`city` = 'Niterói', `campus`.`cep` = 241234, `campus`.`deactivationDate` = '2311-12-23', `campus`.`updated_at` = '2023-08-17 02:33:30.459770' WHERE `campus`.`id` = 26

  def destroy
    @campu.destroy
---
DELETE FROM `campus` WHERE `campus`.`id` = 1

    def set_campu
      @campu = Campu.find(params[:id])
---
SELECT `campus`.* FROM `campus` WHERE `campus`.`id` = 1 LIMIT 1