app/controllers/caronas_controller.rb

SELECT `caronas`.* FROM `caronas`
---
  def index
    @caronas = Carona.all

SELECT `campus`.`description` FROM `campus`
INSERT INTO `caronas` (`motorista`, `inicio`, `fim`, `data`, `hora`, `numero_de_passageiros`, `custo`, `observacao`, `created_at`, `updated_at`) VALUES ('', '20:14', '', '2023-08-17', NULL, NULL, NULL, '', '2023-08-17 23:14:45.041758', '2023-08-17 23:14:45.041758')
---
  def create
    @carona = Carona.new(carona_params)

    if !Campus.pluck(:description).include?(@carona.inicio) && !Campus.pluck(:description).include?(@carona.fim)
      flash[:error] = 'Carona inválida. O ponto de partida ou de chegada devem ser um campus da UFF'
      render :new
    elsif @carona.save

SELECT `campus`.`description` FROM `campus`
UPDATE `caronas` SET `caronas`.`inicio` = 'Gragoata', `caronas`.`data` = '2023-08-30', `caronas`.`hora` = '15:09:00', `caronas`.`updated_at` = '2023-08-30 18:10:50.314138' WHERE `caronas`.`id` = 3
---
  def update
    if !Campus.pluck(:description).include?(params[:carona][:inicio]) && !Campus.pluck(:description).include?(params[:carona][:fim])
      redirect_to edit_carona_path(@carona), notice: 'Carona inválida. O ponto de partida ou de chegada devem ser um campus da UFF'
    elsif @carona.update(carona_params)

DELETE FROM `caronas` WHERE `caronas`.`id` = 7
---
  def destroy
    @carona.destroy

SELECT `caronas`.* FROM `caronas` WHERE `caronas`.`id` = 5 LIMIT 1
---
  def set_carona
    @carona = Carona.find(params[:id])