app/controllers/paradas_controller.rb

  def create
    @carona = Carona.find(params[:carona_id])
    @parada = @carona.paradas.create(parada_params)
---
SELECT `caronas`.* FROM `caronas` WHERE `caronas`.`id` = 10 LIMIT 1
INSERT INTO `paradas` (`local`, `carona_id`, `created_at`, `updated_at`) VALUES ('', 10, '2023-08-18 00:37:56.572351', '2023-08-18 00:37:56.572351')

  def destroy
    @parada = @carona.paradas.find(params[:id])
    @parada.destroy
---
SELECT `paradas`.* FROM `paradas` WHERE `paradas`.`carona_id` = 10 AND `paradas`.`id` = 4 LIMIT 1
DELETE FROM `paradas` WHERE `paradas`.`id` = 4

  def set_carona
    @carona = Carona.find(params[:carona_id])
---
SELECT `caronas`.* FROM `caronas` WHERE `caronas`.`id` = 10 LIMIT 1